Results/Verifications/S2427/bottleneck-determination/point_select/threads-8/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=8 oltp_point_select --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-typ
e=uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 6248.17 qps: 6248.17 (r/w/o: 6248.17/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 6896.44 qps: 6896.44 (r/w/o: 6896.44/0.00/0.00) lat (ms,95%): 1.67 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 7034.91 qps: 7034.91 (r/w/o: 7034.91/0.00/0.00) lat (ms,95%): 1.58 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 6862.80 qps: 6862.80 (r/w/o: 6862.80/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 7028.02 qps: 7028.02 (r/w/o: 7028.02/0.00/0.00) lat (ms,95%): 1.64 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 6994.44 qps: 6994.44 (r/w/o: 6994.44/0.00/0.00) lat (ms,95%): 1.67 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 6904.61 qps: 6904.61 (r/w/o: 6904.61/0.00/0.00) lat (ms,95%): 1.67 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 7014.38 qps: 7014.38 (r/w/o: 7014.38/0.00/0.00) lat (ms,95%): 1.61 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 6961.82 qps: 6961.82 (r/w/o: 6961.82/0.00/0.00) lat (ms,95%): 1.61 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            689067
        write:                           0
        other:                           0
        total:                           689067
    transactions:                        689067 (6890.22 per sec.)
    queries:                             689067 (6890.22 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0056s
    total number of events:              689067

Latency (ms):
         min:                                    0.64
         avg:                                    1.16
         max:                                   37.86
         95th percentile:                        1.70
         sum:                               798928.55

Threads fairness:
    events (avg/stddev):           86133.3750/122.63
    execution time (avg/stddev):   99.8661/0.01


real    1m40.109s
user    0m13.506s
sys     0m25.062s